services/ws-discovery/ws-discovery-api/src/test/java/org/apache/cxf/ws/discovery/msg2.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://www.w3.org/2003/05/soap-envelope" xmlns:SOAP-ENC="http://www.w3.org/2003/05/soap-encoding" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa5="http://www.w3.org/2005/08/addressing" xmlns:c14n="http://www.w3.org/2001/10/xml-exc-c14n#" xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" xmlns:ds="http://www.w3.org/2000/09/xmldsig#" xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" xmlns:tt="http://www.onvif.org/ver10/schema" xmlns:xsm="http://www.w3.org/2005/05/xmlmime" xmlns:wsrf-bf="http://docs.oasis-open.org/wsrf/bf-2" xmlns:wstop="http://docs.oasis-open.org/wsn/t-1" xmlns:wsrf-r="http://docs.oasis-open.org/wsrf/r-2" xmlns:ns10="http://www.onvif.org/ver20/analytics/wsdl/RuleEngineBinding" xmlns:tan="http://www.onvif.org/ver20/analytics/wsdl" xmlns:ns11="http://www.onvif.org/ver20/analytics/wsdl/AnalyticsEngineBinding" xmlns:ns2="http://www.onvif.org/ver10/events/wsdl/PullPointSubscriptionBinding" xmlns:ns3="http://www.onvif.org/ver10/events/wsdl/EventBinding" xmlns:tev="http://www.onvif.org/ver10/events/wsdl" xmlns:ns4="http://www.onvif.org/ver10/events/wsdl/SubscriptionManagerBinding" xmlns:ns5="http://www.onvif.org/ver10/events/wsdl/NotificationProducerBinding" xmlns:ns6="http://www.onvif.org/ver10/events/wsdl/NotificationConsumerBinding" xmlns:ns7="http://www.onvif.org/ver10/events/wsdl/PullPointBinding" xmlns:ns8="http://www.onvif.org/ver10/events/wsdl/CreatePullPointBinding" xmlns:ns9="http://www.onvif.org/ver10/events/wsdl/PausableSubscriptionManagerBinding" xmlns:wsnt="http://docs.oasis-open.org/wsn/b-2" xmlns:tmd="http://www.onvif.org/ver10/deviceIO/wsdl" xmlns:tds="http://www.onvif.org/ver10/device/wsdl" xmlns:timg="http://www.onvif.org/ver20/imaging/wsdl" xmlns:timg10="http://www.onvif.org/ver10/imaging/wsdl" xmlns:tptz="http://www.onvif.org/ver20/ptz/wsdl" xmlns:trt="http://www.onvif.org/ver10/media/wsdl" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:wsd="http://schemas.xmlsoap.org/ws/2005/04/discovery" xmlns:ter="http://www.onvif.org/ver10/error" xmlns:tns1="http://www.onvif.org/ver10/topics" xmlns:tns2="http://www.siqura.com/onvif/topic" xmlns:dn="http://www.onvif.org/ver10/network/wsdl">
    <SOAP-ENV:Header>
        <wsa:MessageID>urn:uuid:d0dca7c4-8c62-46b8-8502-fd511765a3a9</wsa:MessageID>
        <wsa:RelatesTo>urn:uuid:883d0d53-92aa-4066-9b6f-9eadb1832366</wsa:RelatesTo>
        <wsa:To SOAP-ENV:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:To>
        <wsa:Action SOAP-ENV:mustUnderstand="true">http://schemas.xmlsoap.org/ws/2005/04/discovery/ProbeMatches</wsa:Action>
        <wsd:AppSequence MessageNumber="2871" InstanceId="1379153401"/>
    </SOAP-ENV:Header>
    <SOAP-ENV:Body>
        <wsd:ProbeMatches>
            <wsd:ProbeMatch>
                <wsa:EndpointReference>
                    <wsa:Address>urn:uuid:dd38638d-26c0-1ad8-82ee-00047e01d3a5</wsa:Address>
                </wsa:EndpointReference>
                <wsd:Types>dn:NetworkVideoTransmitter</wsd:Types>
                <wsd:Scopes>onvif://www.onvif.org/type/video_encoder onvif://www.onvif.org/type/audio_encoder onvif://www.onvif.org/hardware/S-60%20E-SFP onvif://www.onvif.org/location/origin/Netherlands onvif://www.onvif.org/name/Siqura onvif://www.onvif.org/Profile/Streaming</wsd:Scopes>
                <wsd:XAddrs>http://172.19.121.187/onvif/device_service</wsd:XAddrs>
                <wsd:MetadataVersion>1379153402</wsd:MetadataVersion>
            </wsd:ProbeMatch>
        </wsd:ProbeMatches>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
